//ActivityDisplayName eq 'Update conditional access policy'
AuditLogs
| where OperationName == "Update conditional access policy"
| extend Actor = iff(isempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)) == true, tostring(parse_json(tostring(InitiatedBy.app)).displayName), tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
| extend ConditionalAccessPolicy = tostring(TargetResources[0].displayName)
| project TimeGenerated, Actor, OperationName, ConditionalAccessPolicy, Result, AADOperationType
