//ActivityDisplayName eq 'Set DirSync feature'
AuditLogs
| where OperationName == "Set DirSync feature"
| extend Actor = iff(isempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)) == true, tostring(parse_json(tostring(InitiatedBy.app)).displayName), tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
| distinct TimeGenerated, OperationName, Actor
