//ActivityDisplayName eq 'Enable password writeback for directory'
AuditLogs
| where OperationName == "Enable password writeback for directory"
| extend Actor = iff(isempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)) == true, tostring(parse_json(tostring(InitiatedBy.app)).displayName), tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
| distinct TimeGenerated, OperationName, Actor
