SigninLogs | where TimeGenerated > ago(14d) and ResultType == 0 | where RiskLevelDuringSignIn in ("high","medium") | project AppDisplayName, UserPrincipalName, RiskLevelAggregated, RiskLevelDuringSignIn, RiskState, RiskDetail, RiskEventTypes_V2, ConditionalAccessStatus, AuthenticationRequirement, Category
