{"displayName":"(Internal Users) Always require MFA","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"platforms":null,"locations":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":["45a330b1-b1ec-4cc1-9161-9f03992aa49f"],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":["d29b2b05-8046-44ba-8758-1e26182fcf32"],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":{"guestOrExternalUserTypes":"internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider","externalTenants":{"@odata.type":"#microsoft.graph.conditionalAccessAllExternalTenants","membershipKind":"all"}}}},"grantControls":{"operator":"OR","builtInControls":["mfa"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u00279420a6da-29bc-487a-b7b6-c4dd01143b29\u0027)/grantControls/authenticationStrength/$entity","authenticationStrength":null}}
{"displayName":"(Internal Users) Always require MFA from untrusted networks","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"platforms":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":["45a330b1-b1ec-4cc1-9161-9f03992aa49f"],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":{"guestOrExternalUserTypes":"internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider","externalTenants":{"@odata.type":"#microsoft.graph.conditionalAccessAllExternalTenants","membershipKind":"all"}}},"locations":{"includeLocations":["AllTrusted"],"excludeLocations":["AllTrusted"]}},"grantControls":{"operator":"OR","builtInControls":["mfa"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027c2feac9a-4cf9-4dda-86b2-1ed8ce5c028d\u0027)/grantControls/authenticationStrength/$entity","authenticationStrength":null}}
{"displayName":"(Internal Users) Always require MFA or Trusted Devices or Compliant Devices","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"platforms":null,"locations":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":["45a330b1-b1ec-4cc1-9161-9f03992aa49f"],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":["d29b2b05-8046-44ba-8758-1e26182fcf32"],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":{"guestOrExternalUserTypes":"internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider","externalTenants":{"@odata.type":"#microsoft.graph.conditionalAccessAllExternalTenants","membershipKind":"all"}}}},"grantControls":{"operator":"OR","builtInControls":["mfa","compliantDevice","domainJoinedDevice"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027107dd758-f289-44af-92e2-4dfb966f60f2\u0027)/grantControls/authenticationStrength/$entity","authenticationStrength":null}}
{"displayName":"(Internal Users) Always require MFA or Trusted Devices or Complaint Devices from untrusted  networks","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"platforms":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":["45a330b1-b1ec-4cc1-9161-9f03992aa49f"],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":{"guestOrExternalUserTypes":"internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider","externalTenants":{"@odata.type":"#microsoft.graph.conditionalAccessAllExternalTenants","membershipKind":"all"}}},"locations":{"includeLocations":["All"],"excludeLocations":["AllTrusted"]}},"grantControls":{"operator":"OR","builtInControls":["mfa","compliantDevice","domainJoinedDevice"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027ac5dd357-ee7c-4bad-add7-aea62a42443f\u0027)/grantControls/authenticationStrength/$entity","authenticationStrength":null}}
{"displayName":"(All Users) Require MFA for Microsoft Graph PowerShell and Explorer","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"platforms":null,"locations":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["de8bc8b5-d9f9-48b1-a8ad-b748da725064","14d82eec-204b-4c2f-b7e8-296a70dab67e"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":null}},"grantControls":{"operator":"OR","builtInControls":["mfa"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027bd404e01-144f-4ccb-81c1-3faa03ee5420\u0027)/grantControls/authenticationStrength/$entity","authenticationStrength":null}}
{"displayName":"(All Users) Require MFA for Microsoft Azure Management","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"platforms":null,"locations":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["797f4846-ba00-4fd7-ba43-dac1f8f63013"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":null}},"grantControls":{"operator":"OR","builtInControls":["mfa"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027c293405d-f80c-406b-b5c0-eeee11802245\u0027)/grantControls/authenticationStrength/$entity","authenticationStrength":null}}
{"displayName":"(All Users) Block Legacy Authentication","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["exchangeActiveSync","other"],"servicePrincipalRiskLevels":[],"platforms":null,"locations":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":null}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027f3e767c6-d463-4336-831f-a1e0f5416f20\u0027)/grantControls/authenticationStrength/$entity","authenticationStrength":null}}
{"displayName":"(Privileged Users) Always require MFA","state":"enabledForReportingButNotEnforced","sessionControls":{"disableResilienceDefaults":false,"applicationEnforcedRestrictions":null,"cloudAppSecurity":null,"persistentBrowser":null,"continuousAccessEvaluation":null,"secureSignInSession":null,"signInFrequency":{"value":2,"type":"hours","authenticationType":"primaryAndSecondaryAuthentication","frequencyInterval":"timeBased","isEnabled":true}},"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"platforms":null,"locations":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":[],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":["9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3","c4e39bd9-1100-46d3-8c65-fb160da0071f","158c047a-c907-4556-b7ef-446551a6b5f7","b1be1c3e-b65d-4f19-8427-f6fa0d97feb9","29232cdf-9323-42fd-ade2-1d097af3e4de","62e90394-69f5-4237-9190-012177145e10","729827e3-9c14-49f7-bb1b-9608f156bbb8","8ac3fc64-6eca-42ea-9e69-59f4c7b60eb2","966707d0-3269-4727-9be2-8c3a10f19b9d","7be44c8a-adaf-4e2a-84d6-ab2649e08a13","e8611ab8-c189-46e8-94e1-60213ab1f814","194ae4cb-b126-40b2-bd5b-6091b380977d","f28a1f50-f6e7-4571-818b-6a12f2af6b6c","fe930be7-5e62-47db-91af-98c3a49a38b1"],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":null}},"grantControls":{"operator":"OR","builtInControls":["mfa"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027446d3f64-243d-4e45-bc9f-7612dbf44c87\u0027)/grantControls/authenticationStrength/$entity","authenticationStrength":null}}
{"displayName":"(Privileged Users) Block Legacy Authentication","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["exchangeActiveSync","other"],"servicePrincipalRiskLevels":[],"platforms":null,"locations":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":[],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":["9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3","c4e39bd9-1100-46d3-8c65-fb160da0071f","158c047a-c907-4556-b7ef-446551a6b5f7","b1be1c3e-b65d-4f19-8427-f6fa0d97feb9","29232cdf-9323-42fd-ade2-1d097af3e4de","62e90394-69f5-4237-9190-012177145e10","729827e3-9c14-49f7-bb1b-9608f156bbb8","8ac3fc64-6eca-42ea-9e69-59f4c7b60eb2","966707d0-3269-4727-9be2-8c3a10f19b9d","7be44c8a-adaf-4e2a-84d6-ab2649e08a13","e8611ab8-c189-46e8-94e1-60213ab1f814","194ae4cb-b126-40b2-bd5b-6091b380977d","f28a1f50-f6e7-4571-818b-6a12f2af6b6c","fe930be7-5e62-47db-91af-98c3a49a38b1"],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":null}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u00271398528e-5624-423e-9936-64c490be895d\u0027)/grantControls/authenticationStrength/$entity","authenticationStrength":null}}
{"displayName":"(Directory Sync Account) Block from untrusted networks","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"platforms":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":[],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":["d29b2b05-8046-44ba-8758-1e26182fcf32"],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":null},"locations":{"includeLocations":["All"],"excludeLocations":["AllTrusted"]}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027c534dd3c-79f6-4f73-86b2-5ed04d47ba1b\u0027)/grantControls/authenticationStrength/$entity","authenticationStrength":null}}
{"displayName":"(All Guest) Block from Microsoft Azure Management","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"platforms":null,"locations":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["797f4846-ba00-4fd7-ba43-dac1f8f63013"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":[],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[],"excludeGuestsOrExternalUsers":null,"includeGuestsOrExternalUsers":{"guestOrExternalUserTypes":"internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider","externalTenants":{"@odata.type":"#microsoft.graph.conditionalAccessAllExternalTenants","membershipKind":"all"}}}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027de09684a-22bf-467c-9608-c317e0ea3b14\u0027)/grantControls/authenticationStrength/$entity","authenticationStrength":null}}
{"displayName":"(All Guest) Always Require MFA","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"platforms":null,"locations":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":[],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[],"excludeGuestsOrExternalUsers":null,"includeGuestsOrExternalUsers":{"guestOrExternalUserTypes":"internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider","externalTenants":{"@odata.type":"#microsoft.graph.conditionalAccessAllExternalTenants","membershipKind":"all"}}}},"grantControls":{"operator":"OR","builtInControls":["mfa"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u00275c0ca0d0-640f-4712-8621-bd06af2bf949\u0027)/grantControls/authenticationStrength/$entity","authenticationStrength":null}}
{"displayName":"(Internal Users) Require Compliant Devices for Office 365 / All Apps","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"platforms":null,"locations":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["Office365"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":{"guestOrExternalUserTypes":"internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider","externalTenants":{"@odata.type":"#microsoft.graph.conditionalAccessAllExternalTenants","membershipKind":"all"}}}},"grantControls":{"operator":"OR","builtInControls":["compliantDevice","domainJoinedDevice"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027de26222d-a7b9-40e5-9503-af59f10de568\u0027)/grantControls/authenticationStrength/$entity","authenticationStrength":null}}
{"displayName":"(All Users) No Persistent Browser and 1 Hour Session from Unmanaged Devices","state":"enabledForReportingButNotEnforced","sessionControls":{"disableResilienceDefaults":false,"applicationEnforcedRestrictions":null,"cloudAppSecurity":null,"continuousAccessEvaluation":null,"secureSignInSession":null,"signInFrequency":{"value":1,"type":"hours","authenticationType":"primaryAndSecondaryAuthentication","frequencyInterval":"timeBased","isEnabled":true},"persistentBrowser":{"mode":"never","isEnabled":true}},"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"platforms":null,"locations":null,"times":null,"deviceStates":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":null},"devices":{"includeDeviceStates":[],"excludeDeviceStates":[],"includeDevices":[],"excludeDevices":[],"deviceFilter":{"mode":"include","rule":"device.isCompliant -ne True -and device.trustType -ne \"ServerAD\""}}},"grantControls":null}
{"displayName":"(Privileged Users) Require Compliant Devices","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"platforms":null,"locations":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":[],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":["9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3","c4e39bd9-1100-46d3-8c65-fb160da0071f","158c047a-c907-4556-b7ef-446551a6b5f7","b1be1c3e-b65d-4f19-8427-f6fa0d97feb9","29232cdf-9323-42fd-ade2-1d097af3e4de","62e90394-69f5-4237-9190-012177145e10","729827e3-9c14-49f7-bb1b-9608f156bbb8","8ac3fc64-6eca-42ea-9e69-59f4c7b60eb2","966707d0-3269-4727-9be2-8c3a10f19b9d","7be44c8a-adaf-4e2a-84d6-ab2649e08a13","e8611ab8-c189-46e8-94e1-60213ab1f814","194ae4cb-b126-40b2-bd5b-6091b380977d","f28a1f50-f6e7-4571-818b-6a12f2af6b6c","fe930be7-5e62-47db-91af-98c3a49a38b1"],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":null}},"grantControls":{"operator":"OR","builtInControls":["compliantDevice","domainJoinedDevice"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027b22c808a-c654-49c5-8723-9305912eb5de\u0027)/grantControls/authenticationStrength/$entity","authenticationStrength":null}}
{"displayName":"(Internal Users) Block when user risk is high","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":["high"],"signInRiskLevels":[],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"platforms":null,"locations":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":{"guestOrExternalUserTypes":"internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider","externalTenants":{"@odata.type":"#microsoft.graph.conditionalAccessAllExternalTenants","membershipKind":"all"}}}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027638d7a5a-0574-47a7-8195-97a7fc088817\u0027)/grantControls/authenticationStrength/$entity","authenticationStrength":null}}
{"displayName":"(Internal Users) Block when sign-in risk is high","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":["high"],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"platforms":null,"locations":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":{"guestOrExternalUserTypes":"internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider","externalTenants":{"@odata.type":"#microsoft.graph.conditionalAccessAllExternalTenants","membershipKind":"all"}}}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027c49e4b7c-06ae-4e0e-a16d-ab2977a2b36d\u0027)/grantControls/authenticationStrength/$entity","authenticationStrength":null}}
{"displayName":"(Internal Users) Require MFA when sign-in risk is low, medium or high","state":"enabledForReportingButNotEnforced","sessionControls":{"disableResilienceDefaults":false,"applicationEnforcedRestrictions":null,"cloudAppSecurity":null,"persistentBrowser":null,"continuousAccessEvaluation":null,"secureSignInSession":null,"signInFrequency":{"value":null,"type":null,"authenticationType":"primaryAndSecondaryAuthentication","frequencyInterval":"everyTime","isEnabled":true}},"conditions":{"userRiskLevels":[],"signInRiskLevels":["high","medium","low"],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"platforms":null,"locations":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":{"guestOrExternalUserTypes":"internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider","externalTenants":{"@odata.type":"#microsoft.graph.conditionalAccessAllExternalTenants","membershipKind":"all"}}}},"grantControls":{"operator":"OR","builtInControls":["mfa"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027d9c57ad3-1136-4f5b-9408-d8e5e1e21643\u0027)/grantControls/authenticationStrength/$entity","authenticationStrength":null}}
{"displayName":"(Privileged Users) Block when user risk is low, medium or high","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":["high","medium","low"],"signInRiskLevels":[],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"platforms":null,"locations":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":[],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":["9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3","c4e39bd9-1100-46d3-8c65-fb160da0071f","158c047a-c907-4556-b7ef-446551a6b5f7","b1be1c3e-b65d-4f19-8427-f6fa0d97feb9","29232cdf-9323-42fd-ade2-1d097af3e4de","62e90394-69f5-4237-9190-012177145e10","729827e3-9c14-49f7-bb1b-9608f156bbb8","8ac3fc64-6eca-42ea-9e69-59f4c7b60eb2","966707d0-3269-4727-9be2-8c3a10f19b9d","7be44c8a-adaf-4e2a-84d6-ab2649e08a13","e8611ab8-c189-46e8-94e1-60213ab1f814","194ae4cb-b126-40b2-bd5b-6091b380977d","f28a1f50-f6e7-4571-818b-6a12f2af6b6c","fe930be7-5e62-47db-91af-98c3a49a38b1"],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":null}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027df12f8b6-b074-4cb3-a6e1-d4fb91284709\u0027)/grantControls/authenticationStrength/$entity","authenticationStrength":null}}
{"displayName":"(Privileged Users) Block when sign-in risk is low, medium or high","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":["high","medium","low"],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"platforms":null,"locations":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":[],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":["9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3","c4e39bd9-1100-46d3-8c65-fb160da0071f","158c047a-c907-4556-b7ef-446551a6b5f7","b1be1c3e-b65d-4f19-8427-f6fa0d97feb9","29232cdf-9323-42fd-ade2-1d097af3e4de","62e90394-69f5-4237-9190-012177145e10","729827e3-9c14-49f7-bb1b-9608f156bbb8","8ac3fc64-6eca-42ea-9e69-59f4c7b60eb2","966707d0-3269-4727-9be2-8c3a10f19b9d","7be44c8a-adaf-4e2a-84d6-ab2649e08a13","e8611ab8-c189-46e8-94e1-60213ab1f814","194ae4cb-b126-40b2-bd5b-6091b380977d","f28a1f50-f6e7-4571-818b-6a12f2af6b6c","fe930be7-5e62-47db-91af-98c3a49a38b1"],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":null}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027c03cb110-de8d-421d-be2a-1da4b8732c9b\u0027)/grantControls/authenticationStrength/$entity","authenticationStrength":null}}
{"displayName":"(Directory Sync Account) Block when sign-in risk is low, medium or high","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":["high","medium","low"],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"platforms":null,"locations":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":[],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":["d29b2b05-8046-44ba-8758-1e26182fcf32"],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":null}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u00275d71dd4d-ff81-485a-adba-234686699216\u0027)/grantControls/authenticationStrength/$entity","authenticationStrength":null}}
{"displayName":"(All Guest) Block when sign-in risk is low, medium or high","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":["high","medium","low"],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"platforms":null,"locations":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":[],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[],"excludeGuestsOrExternalUsers":null,"includeGuestsOrExternalUsers":{"guestOrExternalUserTypes":"internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider","externalTenants":{"@odata.type":"#microsoft.graph.conditionalAccessAllExternalTenants","membershipKind":"all"}}}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u00273cd5c284-3ffe-4f48-a567-5696920b3ac9\u0027)/grantControls/authenticationStrength/$entity","authenticationStrength":null}}
