{"@odata.context":"https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies","value":[{"id":"865ee345-d349-4930-a7b5-88e37425bd1e","displayName":"Guest - Block Microsoft Azure Management","createdDateTime":"2022-04-01T19:21:01.6423739Z","modifiedDateTime":"2022-04-06T21:59:33.8388436Z","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"platforms":null,"locations":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["797f4846-ba00-4fd7-ba43-dac1f8f63013"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["GuestsOrExternalUsers"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[]}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[]}},{"id":"635caf94-0df6-4855-9ab0-398f2d764322","displayName":"Guest - Terms of use and Limit Session to 8 hours","createdDateTime":"2022-04-01T19:26:31.5381338Z","modifiedDateTime":"2022-04-06T21:59:41.5980916Z","state":"enabledForReportingButNotEnforced","conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"platforms":null,"locations":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["GuestsOrExternalUsers"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[]}},"grantControls":{"operator":"OR","builtInControls":[],"customAuthenticationFactors":[],"termsOfUse":["c5e2afd2-0967-46c6-b979-860e3dc137b3"]},"sessionControls":{"disableResilienceDefaults":false,"applicationEnforcedRestrictions":null,"cloudAppSecurity":null,"persistentBrowser":null,"signInFrequency":{"value":8,"type":"hours","isEnabled":true}}},{"id":"082865b3-9e08-4a25-89e7-34652860a706","displayName":"Privileged Role Members - Always require MFA and Limit Session","createdDateTime":"2022-04-01T19:52:43.1908608Z","modifiedDateTime":"2022-04-06T22:16:33.8116719Z","state":"enabledForReportingButNotEnforced","conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"platforms":null,"locations":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":[],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":["62e90394-69f5-4237-9190-012177145e10","9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3","c4e39bd9-1100-46d3-8c65-fb160da0071f","158c047a-c907-4556-b7ef-446551a6b5f7","b1be1c3e-b65d-4f19-8427-f6fa0d97feb9","29232cdf-9323-42fd-ade2-1d097af3e4de","8ac3fc64-6eca-42ea-9e69-59f4c7b60eb2","966707d0-3269-4727-9be2-8c3a10f19b9d","7be44c8a-adaf-4e2a-84d6-ab2649e08a13","e8611ab8-c189-46e8-94e1-60213ab1f814","194ae4cb-b126-40b2-bd5b-6091b380977d","f28a1f50-f6e7-4571-818b-6a12f2af6b6c","fe930be7-5e62-47db-91af-98c3a49a38b1"],"excludeRoles":[]}},"grantControls":{"operator":"OR","builtInControls":["mfa"],"customAuthenticationFactors":[],"termsOfUse":[]},"sessionControls":{"disableResilienceDefaults":false,"applicationEnforcedRestrictions":null,"cloudAppSecurity":null,"persistentBrowser":null,"signInFrequency":{"value":2,"type":"hours","isEnabled":true}}},{"id":"ae8b7c96-3d5f-4842-ab64-9a00f3e555bd","displayName":"Privileged Role Members - Sign-in Risk Block All Cloud Apps (low,medium,high)","createdDateTime":"2022-04-01T20:07:18.7143548Z","modifiedDateTime":"2022-04-06T22:00:05.08005Z","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":["high","medium","low"],"clientAppTypes":["all"],"platforms":null,"locations":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["None"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":[],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":["9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3","c4e39bd9-1100-46d3-8c65-fb160da0071f","158c047a-c907-4556-b7ef-446551a6b5f7","b1be1c3e-b65d-4f19-8427-f6fa0d97feb9","62e90394-69f5-4237-9190-012177145e10","8ac3fc64-6eca-42ea-9e69-59f4c7b60eb2","966707d0-3269-4727-9be2-8c3a10f19b9d","7be44c8a-adaf-4e2a-84d6-ab2649e08a13","e8611ab8-c189-46e8-94e1-60213ab1f814","f28a1f50-f6e7-4571-818b-6a12f2af6b6c","fe930be7-5e62-47db-91af-98c3a49a38b1","29232cdf-9323-42fd-ade2-1d097af3e4de","194ae4cb-b126-40b2-bd5b-6091b380977d"],"excludeRoles":[]}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[]}},{"id":"5627af82-f047-47ee-9102-bacf8aa273d4","displayName":"Privileged Role Members - User Risk Block All Cloud Apps (low,medium,high)","createdDateTime":"2022-04-01T20:12:20.4489475Z","modifiedDateTime":"2022-04-06T22:00:15.2523383Z","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":["high","medium","low"],"clientAppTypes":["all"],"platforms":null,"locations":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":[],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":["9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3","c4e39bd9-1100-46d3-8c65-fb160da0071f","b1be1c3e-b65d-4f19-8427-f6fa0d97feb9","29232cdf-9323-42fd-ade2-1d097af3e4de","62e90394-69f5-4237-9190-012177145e10","8ac3fc64-6eca-42ea-9e69-59f4c7b60eb2","966707d0-3269-4727-9be2-8c3a10f19b9d","7be44c8a-adaf-4e2a-84d6-ab2649e08a13","e8611ab8-c189-46e8-94e1-60213ab1f814","194ae4cb-b126-40b2-bd5b-6091b380977d","f28a1f50-f6e7-4571-818b-6a12f2af6b6c","fe930be7-5e62-47db-91af-98c3a49a38b1","158c047a-c907-4556-b7ef-446551a6b5f7"],"excludeRoles":[]}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[]}},{"id":"a0776198-9af9-4996-af37-ae0f86cdf619","displayName":"Privileged Role Members - Sign-in Risk Block Security Information Registration (low,medium,high)","createdDateTime":"2022-04-01T20:17:22.9931013Z","modifiedDateTime":"2022-04-06T22:17:02.6516741Z","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":["high","medium","low"],"clientAppTypes":["all"],"platforms":null,"locations":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":[],"excludeApplications":[],"includeUserActions":["urn:user:registersecurityinfo"],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":[],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":["9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3","c4e39bd9-1100-46d3-8c65-fb160da0071f","158c047a-c907-4556-b7ef-446551a6b5f7","b1be1c3e-b65d-4f19-8427-f6fa0d97feb9","29232cdf-9323-42fd-ade2-1d097af3e4de","62e90394-69f5-4237-9190-012177145e10","966707d0-3269-4727-9be2-8c3a10f19b9d","7be44c8a-adaf-4e2a-84d6-ab2649e08a13","e8611ab8-c189-46e8-94e1-60213ab1f814","194ae4cb-b126-40b2-bd5b-6091b380977d","f28a1f50-f6e7-4571-818b-6a12f2af6b6c","fe930be7-5e62-47db-91af-98c3a49a38b1","8ac3fc64-6eca-42ea-9e69-59f4c7b60eb2"],"excludeRoles":[]}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[]}},{"id":"f6147f5c-4323-43b5-b285-2e75d2f784f5","displayName":"Directory Sync Account - Block Non Trusted Networks","createdDateTime":"2022-04-01T20:30:54.8114128Z","modifiedDateTime":"2022-04-06T22:00:33.9845018Z","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"platforms":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":[],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":["d29b2b05-8046-44ba-8758-1e26182fcf32"],"excludeRoles":[]},"locations":{"includeLocations":["All"],"excludeLocations":["AllTrusted"]}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[]}},{"id":"ba198bec-e180-479e-bf4c-e739cbec59fe","displayName":"Directory Sync Account - Sign-in Risk Block All Cloud Apps (low,medium,high)","createdDateTime":"2022-04-01T20:33:48.1904575Z","modifiedDateTime":"2022-04-06T22:00:41.2024864Z","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":["high","medium","low"],"clientAppTypes":["all"],"platforms":null,"locations":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":[],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":["d29b2b05-8046-44ba-8758-1e26182fcf32"],"excludeRoles":[]}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[]}},{"id":"fee99719-186c-4e8c-97b7-8523596e3c19","displayName":"All Users - Require MFA for All Cloud Apps","createdDateTime":"2022-04-01T20:41:48.2054343Z","modifiedDateTime":"2022-04-06T22:17:45.678828Z","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"platforms":null,"locations":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[]}},"grantControls":{"operator":"OR","builtInControls":["mfa"],"customAuthenticationFactors":[],"termsOfUse":[]}},{"id":"b3f68de6-147f-4c1b-b0bd-91a61f55249b","displayName":"All Users - Require Compliant Device for All Cloud Apps","createdDateTime":"2022-04-01T20:59:16.8701305Z","modifiedDateTime":"2022-04-06T22:01:02.5815603Z","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"platforms":null,"locations":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":["d29b2b05-8046-44ba-8758-1e26182fcf32"]}},"grantControls":{"operator":"OR","builtInControls":["compliantDevice"],"customAuthenticationFactors":[],"termsOfUse":[]}},{"id":"3b351a9d-de08-48c1-ba33-00c0c0c91708","displayName":"All Users - Sign-in Risk Block All Cloud Apps (high)","createdDateTime":"2022-04-01T21:21:34.0362861Z","modifiedDateTime":"2022-04-06T22:04:18.951198Z","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":["high"],"clientAppTypes":["all"],"platforms":null,"locations":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[]}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[]}},{"id":"71a78d14-0b59-420a-875b-3d9a5d88fae7","displayName":"All Users - User Risk Block All Cloud Apps (high)","createdDateTime":"2022-04-01T21:22:38.0318796Z","modifiedDateTime":"2022-04-06T22:01:18.6131733Z","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":["high"],"signInRiskLevels":[],"clientAppTypes":["all"],"platforms":null,"locations":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[]}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[]}},{"id":"e5a20be6-8f1c-4fb1-9ce7-f1eb035c6ced","displayName":"All Users - Sign-in Risk Block Microsoft Azure Management (low,medium,high)","createdDateTime":"2022-04-01T21:25:41.5575895Z","modifiedDateTime":"2022-04-06T22:18:28.5758368Z","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":["high","medium","low"],"clientAppTypes":["all"],"platforms":null,"locations":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["797f4846-ba00-4fd7-ba43-dac1f8f63013"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[]}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[]}},{"id":"a7a6818c-eabb-43d7-ad90-220b36d40cf2","displayName":"All Users - Sign-in Risk Block Security Information Registration (medium,high)","createdDateTime":"2022-04-01T21:36:45.4447076Z","modifiedDateTime":"2022-04-06T22:01:53.3824054Z","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":["high","medium"],"clientAppTypes":["all"],"platforms":null,"locations":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":[],"excludeApplications":[],"includeUserActions":["urn:user:registersecurityinfo"],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[]}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[]}},{"id":"9cce67a0-33bb-4f60-a5eb-3bf18739c002","displayName":"All Users - Require MFA Device Join/Registration","createdDateTime":"2022-04-01T21:41:09.3803171Z","modifiedDateTime":"2022-04-06T22:02:04.7574751Z","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"platforms":null,"locations":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":[],"excludeApplications":[],"includeUserActions":["urn:user:registerdevice"],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[]}},"grantControls":{"operator":"OR","builtInControls":["mfa"],"customAuthenticationFactors":[],"termsOfUse":[]}},{"id":"2e96c70f-e453-44bd-91b8-2cc0eb47c48e","displayName":"All Users - Block Legacy Authentication","createdDateTime":"2022-04-01T21:47:43.0792011Z","modifiedDateTime":"2022-04-06T22:02:13.6481851Z","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["exchangeActiveSync","other"],"platforms":null,"locations":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[]}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[]}},{"id":"a317e589-1036-477e-816b-d1a4e0bdca8f","displayName":"All Users - Require MFA for Microsoft Azure Management","createdDateTime":"2022-04-01T22:04:52.6485337Z","modifiedDateTime":"2022-04-06T22:02:22.1165989Z","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"platforms":null,"locations":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["797f4846-ba00-4fd7-ba43-dac1f8f63013"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[]}},"grantControls":{"operator":"OR","builtInControls":["mfa"],"customAuthenticationFactors":[],"termsOfUse":[]}},{"id":"0d16c212-ee33-4182-9327-592838b0715b","displayName":"All Users - Block Tor Exit Nodes","createdDateTime":"2022-04-01T22:28:12.9787772Z","modifiedDateTime":"2022-04-06T22:03:31.7366011Z","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"platforms":null,"devices":null,"clientApplications":null,"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[]},"users":{"includeUsers":[],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":["62e90394-69f5-4237-9190-012177145e10"],"excludeRoles":[]},"locations":{"includeLocations":["0154749e-40cf-441d-b306-a930c77f0a5a"],"excludeLocations":[]}},"grantControls":{"operator":"OR","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[]}}]}
