{"@odata.context":"https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies","value":[{"id":"865ee345-d349-4930-a7b5-88e37425bd1e","displayName":"Guest - Block Microsoft Azure Management","createdDateTime":"\/Date(1648840861642)\/","modifiedDateTime":"\/Date(1649885382979)\/","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":"@{userRiskLevels=System.Object[]; signInRiskLevels=System.Object[]; clientAppTypes=System.Object[]; platforms=; locations=; devices=; clientApplications=; applications=; users=}","grantControls":"@{operator=OR; builtInControls=System.Object[]; customAuthenticationFactors=System.Object[]; termsOfUse=System.Object[]}"},{"id":"635caf94-0df6-4855-9ab0-398f2d764322","displayName":"Guest - Terms of use and Limit Session to 8 hours","createdDateTime":"\/Date(1648841191538)\/","modifiedDateTime":"\/Date(1649885390362)\/","state":"enabledForReportingButNotEnforced","conditions":"@{userRiskLevels=System.Object[]; signInRiskLevels=System.Object[]; clientAppTypes=System.Object[]; platforms=; locations=; devices=; clientApplications=; applications=; users=}","grantControls":"@{operator=OR; builtInControls=System.Object[]; customAuthenticationFactors=System.Object[]; termsOfUse=System.Object[]}","sessionControls":"@{disableResilienceDefaults=False; applicationEnforcedRestrictions=; cloudAppSecurity=; persistentBrowser=; signInFrequency=}"},{"id":"082865b3-9e08-4a25-89e7-34652860a706","displayName":"Privileged Role Members - Always require MFA and Limit Session","createdDateTime":"\/Date(1648842763190)\/","modifiedDateTime":"\/Date(1649885402330)\/","state":"enabledForReportingButNotEnforced","conditions":"@{userRiskLevels=System.Object[]; signInRiskLevels=System.Object[]; clientAppTypes=System.Object[]; platforms=; locations=; devices=; clientApplications=; applications=; users=}","grantControls":"@{operator=OR; builtInControls=System.Object[]; customAuthenticationFactors=System.Object[]; termsOfUse=System.Object[]}","sessionControls":"@{disableResilienceDefaults=False; applicationEnforcedRestrictions=; cloudAppSecurity=; persistentBrowser=; signInFrequency=}"},{"id":"ae8b7c96-3d5f-4842-ab64-9a00f3e555bd","displayName":"Privileged Role Members - Sign-in Risk Block All Cloud Apps (low,medium,high)","createdDateTime":"\/Date(1648843638714)\/","modifiedDateTime":"\/Date(1649885410143)\/","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":"@{userRiskLevels=System.Object[]; signInRiskLevels=System.Object[]; clientAppTypes=System.Object[]; platforms=; locations=; devices=; clientApplications=; applications=; users=}","grantControls":"@{operator=OR; builtInControls=System.Object[]; customAuthenticationFactors=System.Object[]; termsOfUse=System.Object[]}"},{"id":"5627af82-f047-47ee-9102-bacf8aa273d4","displayName":"Privileged Role Members - User Risk Block All Cloud Apps (low,medium,high)","createdDateTime":"\/Date(1648843940448)\/","modifiedDateTime":"\/Date(1649885417479)\/","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":"@{userRiskLevels=System.Object[]; signInRiskLevels=System.Object[]; clientAppTypes=System.Object[]; platforms=; locations=; devices=; clientApplications=; applications=; users=}","grantControls":"@{operator=OR; builtInControls=System.Object[]; customAuthenticationFactors=System.Object[]; termsOfUse=System.Object[]}"},{"id":"a0776198-9af9-4996-af37-ae0f86cdf619","displayName":"Privileged Role Members - Sign-in Risk Block Security Information Registration (low,medium,high)","createdDateTime":"\/Date(1648844242993)\/","modifiedDateTime":"\/Date(1649885424901)\/","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":"@{userRiskLevels=System.Object[]; signInRiskLevels=System.Object[]; clientAppTypes=System.Object[]; platforms=; locations=; devices=; clientApplications=; applications=; users=}","grantControls":"@{operator=OR; builtInControls=System.Object[]; customAuthenticationFactors=System.Object[]; termsOfUse=System.Object[]}"},{"id":"f6147f5c-4323-43b5-b285-2e75d2f784f5","displayName":"Directory Sync Account - Block Non Trusted Networks","createdDateTime":"\/Date(1648845054811)\/","modifiedDateTime":"\/Date(1649885430585)\/","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":"@{userRiskLevels=System.Object[]; signInRiskLevels=System.Object[]; clientAppTypes=System.Object[]; platforms=; devices=; clientApplications=; applications=; users=; locations=}","grantControls":"@{operator=OR; builtInControls=System.Object[]; customAuthenticationFactors=System.Object[]; termsOfUse=System.Object[]}"},{"id":"ba198bec-e180-479e-bf4c-e739cbec59fe","displayName":"Directory Sync Account - Sign-in Risk Block All Cloud Apps (low,medium,high)","createdDateTime":"\/Date(1648845228190)\/","modifiedDateTime":"\/Date(1649885437625)\/","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":"@{userRiskLevels=System.Object[]; signInRiskLevels=System.Object[]; clientAppTypes=System.Object[]; platforms=; locations=; devices=; clientApplications=; applications=; users=}","grantControls":"@{operator=OR; builtInControls=System.Object[]; customAuthenticationFactors=System.Object[]; termsOfUse=System.Object[]}"},{"id":"fee99719-186c-4e8c-97b7-8523596e3c19","displayName":"All Users - Require MFA for All Cloud Apps","createdDateTime":"\/Date(1648845708205)\/","modifiedDateTime":"\/Date(1649885488627)\/","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":"@{userRiskLevels=System.Object[]; signInRiskLevels=System.Object[]; clientAppTypes=System.Object[]; platforms=; locations=; devices=; clientApplications=; applications=; users=}","grantControls":"@{operator=OR; builtInControls=System.Object[]; customAuthenticationFactors=System.Object[]; termsOfUse=System.Object[]}"},{"id":"b3f68de6-147f-4c1b-b0bd-91a61f55249b","displayName":"All Users - Require Compliant Device for All Cloud Apps","createdDateTime":"\/Date(1648846756870)\/","modifiedDateTime":"\/Date(1649885475429)\/","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":"@{userRiskLevels=System.Object[]; signInRiskLevels=System.Object[]; clientAppTypes=System.Object[]; platforms=; locations=; devices=; clientApplications=; applications=; users=}","grantControls":"@{operator=OR; builtInControls=System.Object[]; customAuthenticationFactors=System.Object[]; termsOfUse=System.Object[]}"},{"id":"3b351a9d-de08-48c1-ba33-00c0c0c91708","displayName":"All Users - Sign-in Risk Block All Cloud Apps (high)","createdDateTime":"\/Date(1648848094036)\/","modifiedDateTime":"\/Date(1649885499694)\/","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":"@{userRiskLevels=System.Object[]; signInRiskLevels=System.Object[]; clientAppTypes=System.Object[]; platforms=; locations=; devices=; clientApplications=; applications=; users=}","grantControls":"@{operator=OR; builtInControls=System.Object[]; customAuthenticationFactors=System.Object[]; termsOfUse=System.Object[]}"},{"id":"71a78d14-0b59-420a-875b-3d9a5d88fae7","displayName":"All Users - User Risk Block All Cloud Apps (high)","createdDateTime":"\/Date(1648848158031)\/","modifiedDateTime":"\/Date(1649885507008)\/","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":"@{userRiskLevels=System.Object[]; signInRiskLevels=System.Object[]; clientAppTypes=System.Object[]; platforms=; locations=; devices=; clientApplications=; applications=; users=}","grantControls":"@{operator=OR; builtInControls=System.Object[]; customAuthenticationFactors=System.Object[]; termsOfUse=System.Object[]}"},{"id":"e5a20be6-8f1c-4fb1-9ce7-f1eb035c6ced","displayName":"All Users - Sign-in Risk Block Microsoft Azure Management (low,medium,high)","createdDateTime":"\/Date(1648848341557)\/","modifiedDateTime":"\/Date(1649885515046)\/","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":"@{userRiskLevels=System.Object[]; signInRiskLevels=System.Object[]; clientAppTypes=System.Object[]; platforms=; locations=; devices=; clientApplications=; applications=; users=}","grantControls":"@{operator=OR; builtInControls=System.Object[]; customAuthenticationFactors=System.Object[]; termsOfUse=System.Object[]}"},{"id":"a7a6818c-eabb-43d7-ad90-220b36d40cf2","displayName":"All Users - Sign-in Risk Block Security Information Registration (medium,high)","createdDateTime":"\/Date(1648849005444)\/","modifiedDateTime":"\/Date(1649885521308)\/","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":"@{userRiskLevels=System.Object[]; signInRiskLevels=System.Object[]; clientAppTypes=System.Object[]; platforms=; locations=; devices=; clientApplications=; applications=; users=}","grantControls":"@{operator=OR; builtInControls=System.Object[]; customAuthenticationFactors=System.Object[]; termsOfUse=System.Object[]}"},{"id":"9cce67a0-33bb-4f60-a5eb-3bf18739c002","displayName":"All Users - Require MFA Device Join/Registration","createdDateTime":"\/Date(1648849269380)\/","modifiedDateTime":"\/Date(1649885527468)\/","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":"@{userRiskLevels=System.Object[]; signInRiskLevels=System.Object[]; clientAppTypes=System.Object[]; platforms=; locations=; devices=; clientApplications=; applications=; users=}","grantControls":"@{operator=OR; builtInControls=System.Object[]; customAuthenticationFactors=System.Object[]; termsOfUse=System.Object[]}"},{"id":"2e96c70f-e453-44bd-91b8-2cc0eb47c48e","displayName":"All Users - Block Legacy Authentication","createdDateTime":"\/Date(1648849663079)\/","modifiedDateTime":"\/Date(1649885535699)\/","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":"@{userRiskLevels=System.Object[]; signInRiskLevels=System.Object[]; clientAppTypes=System.Object[]; platforms=; locations=; devices=; clientApplications=; applications=; users=}","grantControls":"@{operator=OR; builtInControls=System.Object[]; customAuthenticationFactors=System.Object[]; termsOfUse=System.Object[]}"},{"id":"a317e589-1036-477e-816b-d1a4e0bdca8f","displayName":"All Users - Require MFA for Microsoft Azure Management","createdDateTime":"\/Date(1648850692648)\/","modifiedDateTime":"\/Date(1649885542621)\/","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":"@{userRiskLevels=System.Object[]; signInRiskLevels=System.Object[]; clientAppTypes=System.Object[]; platforms=; locations=; devices=; clientApplications=; applications=; users=}","grantControls":"@{operator=OR; builtInControls=System.Object[]; customAuthenticationFactors=System.Object[]; termsOfUse=System.Object[]}"},{"id":"0d16c212-ee33-4182-9327-592838b0715b","displayName":"All Users - Block Tor Exit Nodes","createdDateTime":"\/Date(1648852092978)\/","modifiedDateTime":"\/Date(1649885549324)\/","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":"@{userRiskLevels=System.Object[]; signInRiskLevels=System.Object[]; clientAppTypes=System.Object[]; platforms=; devices=; clientApplications=; applications=; users=; locations=}","grantControls":"@{operator=OR; builtInControls=System.Object[]; customAuthenticationFactors=System.Object[]; termsOfUse=System.Object[]}"},{"id":"38ba055e-db4d-4d5c-a836-6aacb700fe18","displayName":"Guest - Sign-in Risk Block All Cloud Apps (low,medium,high)","createdDateTime":"\/Date(1649695437155)\/","modifiedDateTime":"\/Date(1649885556965)\/","state":"enabledForReportingButNotEnforced","sessionControls":null,"conditions":"@{userRiskLevels=System.Object[]; signInRiskLevels=System.Object[]; clientAppTypes=System.Object[]; platforms=; locations=; devices=; clientApplications=; applications=; users=}","grantControls":"@{operator=OR; builtInControls=System.Object[]; customAuthenticationFactors=System.Object[]; termsOfUse=System.Object[]}"}]}
