AuditLogs
| where TimeGenerated > ago(90d)
| where ActivityDisplayName == "Add member to group"
| extend TargetGroup =  tostring(parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[1].newValue)))
| extend Actor = iff(isempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)) == true, tostring(parse_json(tostring(InitiatedBy.app)).displayName), tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
| extend Member = tostring(TargetResources[0].displayName)
| extend MemberType = tostring(TargetResources[0].displayName)
| project TimeGenerated, ActivityDisplayName, TargetGroup, Actor, Member, MemberType
