AuditLogs
| where TimeGenerated >= ago(30d)
| where OperationName == 'Add group'
| extend Actor = iff(isempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)) == true, tostring(parse_json(tostring(InitiatedBy.app)).displayName), tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
| mv-expand TargetResources
| extend Target = tostring(TargetResources.displayName)
| extend Unified = TargetResources contains "unified"
| distinct Actor, Target,Identity, Unified
