AuditLogs
| where TimeGenerated > ago(365d)
| where ActivityDisplayName == "Add Windows Hello for Business credential"
| extend Actor = iff(isempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)) == true, tostring(parse_json(tostring(InitiatedBy.app)).displayName), tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
| extend Target =  tostring(TargetResources[0].userPrincipalName)
| distinct Actor, Target, OperationName
