AADServicePrincipalSignInLogs 
| where TimeGenerated > ago(30d)  
| where ResultType == 7000215
| summarize badkeyattempt = count() by ServicePrincipalName, startofday(TimeGenerated)
| where badkeyattempt > 5
| sort by badkeyattempt
