//this will look for service principals with 7000222: The provided client secret keys are expired
AADServicePrincipalSignInLogs  
| where ResultType == 7000222
| distinct ResourceDisplayName, ServicePrincipalName, ResultType
