SigninLogs
| where TimeGenerated >= ago(30d)
| where ResultType  == 530032
| where HomeTenantId <> ResourceTenantId
| distinct TimeGenerated, UserPrincipalName, AppDisplayName, ResultType, ResultDescription
