SigninLogs
| where TimeGenerated > ago(14d) 
| where AADTenantId == ResourceTenantId
| where RiskLevelDuringSignIn in ("high","medium","low") or RiskLevelAggregated in ("high","medium","low")
| where RiskState !in ("dismissed","remediated")
//| extend something = todynamic(RiskEventTypes_V2)
| mv-expand RiskEventType = todynamic(RiskEventTypes_V2)
| distinct UserPrincipalName, RiskLevelDuringSignIn, RiskLevelAggregated, tostring(RiskEventType), RiskDetail, RiskLevel, RiskState
