SigninLogs | where TimeGenerated > ago(14d) and ResultType == 0  | where RiskState == "atRisk" and RiskLevelAggregated == 'high' | project AppDisplayName, UserPrincipalName,UserType, RiskLevelAggregated, RiskLevelDuringSignIn, RiskState, RiskDetail,IsRisky, RiskEventTypes_V2, MfaDetail, ConditionalAccessStatus, AuthenticationRequirement, ResultType,ResultDescription,AADTenantId,ResourceTenantId
