SigninLogs | where TimeGenerated > ago(14d) | where ResultType !in (0,50074,50140)  | where AppDisplayName <> "Microsoft Authentication Broker" | where RiskState == "atRisk" and RiskLevelAggregated == 'high' | extend authRequirement = tostring(parse_json(AuthenticationRequirementPolicies)[1].requirementProvider) | where authRequirement <> "riskBasedPolicy"| project TimeGenerated,ResultType, ResultDescription,AppDisplayName, UserPrincipalName,UserType, RiskLevelAggregated, RiskLevelDuringSignIn, RiskState, RiskDetail, RiskEventTypes_V2, ConditionalAccessStatus, AuthenticationRequirement,AADTenantId,ResourceTenantId
