SigninLogs
| where TimeGenerated > ago(14d) 
| where AADTenantId == ResourceTenantId
| where RiskState == "remediated"
| where RiskLevelDuringSignIn in ("high","medium","low") 
| extend mfaUsed = tostring(MfaDetail.authMethod)
| project AppDisplayName, UserPrincipalName, RiskLevelAggregated, RiskLevelDuringSignIn, RiskState, RiskDetail, RiskEventTypes_V2, mfaUsed, MfaDetail,ConditionalAccessStatus, AuthenticationRequirement, Category, ResultType, ResultDescription
| summarize mfaTypeCount = count() by mfaUsed, RiskLevelDuringSignIn
| sort mfaTypeCount desc 
