SigninLogs | where TimeGenerated > ago(14d) | where ResultType in (0) | where AppDisplayName <> "Microsoft Authentication Broker"  | where RiskLevelDuringSignIn in ("high") | project TimeGenerated,ResultType, ResultDescription,AppDisplayName, UserPrincipalName,UserType, RiskLevelAggregated, RiskLevelDuringSignIn, RiskState, RiskDetail, RiskEventTypes_V2, ConditionalAccessStatus, AuthenticationRequirement,AADTenantId,ResourceTenantId
