//https://github.com/reprise99/Sentinel-Queries/blob/main/Azure%20Active%20Directory/Audit-NewOperations.kql

AuditLogs
| where TimeGenerated > ago(90d) and TimeGenerated < ago(7d)
| distinct OperationName
| join kind=rightanti
    (AuditLogs
    | where TimeGenerated > ago(7d)
    | summarize NewOperationCount=count() by OperationName, Category)
    on OperationName
| sort by NewOperationCount desc 
