let msappid = (externaldata(defaultappid:string)[@"https://raw.githubusercontent.com/chadmcox/Azure_Active_Directory/master/Applications/microsoftazuremanagementlist.txt"]
with(format="txt"));
let timerange=1d;
SigninLogs
| where TimeGenerated > ago(timerange)
| where AppId in (msappid)
| where ResultType == 0
| where AuthenticationRequirement == "singleFactorAuthentication"
| project AppId,AppDisplayName,ResourceDisplayName, UserPrincipalName, MfaDetail,ConditionalAccessStatus,AuthenticationRequirement, Status
