// this only looks for non failure sign-ins
//  highly recommend setting up an alert for this
let PowershellApps = pack_array('cb1056e2-e479-49de-ae31-7812af012ed8','1b730954-1685-4b74-9bfd-dac224a7b894', '1950a258-227b-4e31-a9cf-717495945fc2', '04b07795-8ddb-461a-bbee-02f9e1bf7b46','14d82eec-204b-4c2f-b7e8-296a70dab67e','fb78d390-0c51-40cd-8e17-fdbfab77341b');
union SigninLogs ,AADNonInteractiveUserSignInLogs
| where TimeGenerated > ago(17d) 
| where UserAgent has "node-fetch" or UserAgent has "python-requests" or UserAgent has "go-resty/2.14.0 (https://github.com/go-resty/resty)" or UserAgent has "go-http-client" or UserAgent has "FastHttp"
| where ResultType !in (50053,50126)
| where AppId in~ (PowershellApps)
| project TimeGenerated,AppDisplayName, UserPrincipalName, ConditionalAccessStatus, AuthenticationRequirement, ResultType,ResultDescription, Location, Identity, IPAddress, AutonomousSystemNumber, UserAgent
