SigninLogs 
| where TimeGenerated > ago(17d) 
| where UserAgent has "go-resty/2.14.0 (https://github.com/go-resty/resty)"
| project TimeGenerated,AppDisplayName, UserPrincipalName, ConditionalAccessStatus, AuthenticationRequirement, ResultType,ResultDescription, Location, Identity, IPAddress, AutonomousSystemNumber, UserAgent
