//the goal would be to use approleassignments to protect these endpoints
//This query can be used to see who is successfully signing into each on to populate the group that gives access to the endpoint.
let PowershellApps = pack_array('1b730954-1685-4b74-9bfd-dac224a7b894', '1950a258-227b-4e31-a9cf-717495945fc2', '04b07795-8ddb-461a-bbee-02f9e1bf7b46','14d82eec-204b-4c2f-b7e8-296a70dab67e','fb78d390-0c51-40cd-8e17-fdbfab77341b');
SigninLogs
| where TimeGenerated > ago(30d)
| where AppId in~ (PowershellApps)
| where ResultType in (0)
| distinct AppDisplayName, UserPrincipalName
