SigninLogs
| where ResultType == 0
| where RiskLevelDuringSignIn in ("high","medium")
| where RiskState in ("remediated") and RiskDetail == "userPassedMFADrivenByRiskBasedPolicy"
| where Status has "MFA requirement satisfied by claim provided by external provider"
| distinct UserPrincipalName=tolower(UserPrincipalName),UserDisplayName, UserType, RiskState, RiskLevelDuringSignIn, AppDisplayName, RiskLevelAggregated, RiskEventTypes_V2
| summarize  Applications=make_set(AppDisplayName),
["User risk level"]=make_set(RiskLevelAggregated), 
["Risk types"]=make_set(RiskEventTypes_V2)
 by UserDisplayName,UserPrincipalName, UserType,  ["Sign-in risk level"] = RiskLevelDuringSignIn
 | project ["User display name"] = UserDisplayName,["User principal name"] = UserPrincipalName, ["User type"] = UserType, ["User risk level"], ["Sign-in risk level"], ["Risk types"],Applications
