 SigninLogs 
 | where TimeGenerated > ago(14d)
 | where AADTenantId == ResourceTenantId
 | where AppDisplayName == "Microsoft Intune Enrollment"
 | where AuthenticationRequirement == 'singleFactorAuthentication'
 | distinct AppDisplayName, UserPrincipalName, AuthenticationRequirement
