
let thisTenantId = SigninLogs | take 1 | distinct AADTenantId;
AADNonInteractiveUserSignInLogs | union SigninLogs | where TimeGenerated > ago(14d) 
| where HomeTenantId !in (thisTenantId) and HomeTenantId <> '' 
| project UserId, AppDisplayName, UserPrincipalName, ResultType
| summarize 
    ['Total Signin Count']=count(),
    ['Total Successful Logins']=countif(ResultType == 0) by AppDisplayName
