let thisTenantId = SigninLogs | take 1 | distinct AADTenantId;
AADNonInteractiveUserSignInLogs | union SigninLogs | where TimeGenerated > ago(14d) 
| where HomeTenantId !in (thisTenantId) and HomeTenantId <> '' 
| distinct UserId, AppDisplayName
| summarize externalguestcount = count() by AppDisplayName
