AuditLogs
| where TimeGenerated > ago (60d)
| where OperationName in ("Delete user","Invite external user")
| extend Actor = iff(isempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)) == true, tostring(parse_json(tostring(InitiatedBy.app)).displayName), tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
| where Actor !contains "Sync_"
| where Actor <> "Microsoft Substrate Management"
| extend Target =  tostring(TargetResources[0].userPrincipalName)
| where Target has "#EXT#"
| summarize 
    deletedguestcount = countif(OperationName == "Delete user"),
    invitedguestcount = countif(OperationName == "Invite external user")
     by startofday(TimeGenerated)
| render columnchart
    with (
    title="Guest Invites v Guest Removed",
    xtitle="Invites",
    kind=unstacked)
