AuditLogs
| where TimeGenerated > ago(1d)
| where LoggedByService == "PIM"
| where Category == "GroupManagement"
| where OperationName == "Add eligible member to role in PIM completed (timebound)"
| extend Group = tostring(TargetResources[3].displayName)
| extend Target = tostring(TargetResources[2].userPrincipalName)
| extend Actor = iff(isempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)) == true, tostring(parse_json(tostring(InitiatedBy.app)).displayName), tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
| project TimeGenerated, OperationName, Group, Target, Actor
