AuditLogs
| where TimeGenerated > ago(1d)
| where Category == "GroupManagement"
| where OperationName == "Add member to group"
| extend Target = tostring(TargetResources[0].userPrincipalName)
| extend Group = tostring(parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[1].newValue)))
| extend Actor = iff(isempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)) == true, tostring(parse_json(tostring(InitiatedBy.app)).displayName), tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
| project TimeGenerated, OperationName, Group, Target, Actor
