AuditLogs 
| where TimeGenerated > ago(10d) 
| where OperationName in ("Change user password","Change password (self-service)","Self-service password reset flow activity progress","Reset password (self-service)","Reset user password","Reset password (by admin)")
| where Result == "failure"
| extend Target =  tostring(TargetResources[0].userPrincipalName)
| extend Actor = iff(isempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)) == true, tostring(parse_json(tostring(InitiatedBy.app)).displayName), tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
| extend ErrorMessage = tostring(AdditionalDetails[1].value)
| project TimeGenerated, Target, OperationName, ResultReason, ResultDescription, ErrorMessage
