AuditLogs 
| where TimeGenerated > ago(10d) 
| where Result == "failure"
| extend Target =  tostring(TargetResources[0].userPrincipalName)
| where ResultReason contains "banned"
| project TimeGenerated, Target, OperationName, ResultReason, ResultDescription
