AuditLogs 
| where TimeGenerated > ago(10d) 
| where Result == "failure"
| where ResultReason == "Password reset has been disabled entirely for this tenant. See http://aka.ms/ssprtroubleshoot to resolve this."
