AuditLogs 
| where TimeGenerated > ago(10d) 
| where Result == "failure"
| where ResultReason == "We could not reach your on-premises password reset service. Check your sync machine's event log" or ResultReason == "OnPremisesConnectivityFailure"
