let includeapps = pack_array("Azure Portal","Windows Azure Service Management API","Microsoft Azure PowerShell","Azure DevOps");
let thisTenantId = SigninLogs | take 1 | distinct AADTenantId;
AADNonInteractiveUserSignInLogs | union SigninLogs
| where TimeGenerated > ago(14d) and ResultType == 0
| where HomeTenantId !in (thisTenantId) and HomeTenantId <> '' 
| where  ResourceDisplayName == "Windows Azure Service Management API" or AppDisplayName in (includeapps)
//| where AADTenantId == ResourceTenantId
| distinct AppDisplayName, UserPrincipalName, ConditionalAccessStatus, AuthenticationRequirement, ResourceDisplayName
