SigninLogs
| where TimeGenerated > ago(14d) 
| where AADTenantId == ResourceTenantId
| where RiskLevelAggregated in ("medium","low")
| where RiskState !in ("dismissed","remediated")
| mv-expand RiskEventType = todynamic(RiskEventTypes_V2)
| distinct UserPrincipalName, RiskLevelAggregated, tostring(RiskEventType), RiskDetail, RiskLevel, RiskState
| project UserPrincipalName, RiskLevelAggregated, tostring(RiskEventType), RiskDetail, RiskLevel, RiskState
