SigninLogs 
| where ResultType == 50142
| where AuthenticationRequirementPolicies contains "riskBasedPolicy"
| mv-expand ConditionalAccessPolicies
| where ConditionalAccessPolicies["enforcedGrantControls"] contains "MfaAndChangePassword"
| where ConditionalAccessPolicies["result"] contains "failure"
| extend RBCA = ConditionalAccessPolicies["displayName"]
| project UserPrincipalName, RiskLevelDuringSignIn, RiskLevelAggregated,  RiskDetail, RiskLevel, RiskState, RBCA
