//this query shows if users are connecting using exchangeactivesync
AADNonInteractiveUserSignInLogs 
| union SigninLogs 
| where TimeGenerated > ago(14d) 
| where ClientAppUsed contains "Exchange ActiveSync" 
| distinct UserDisplayName, UserPrincipalName, AppDisplayName, ClientAppUsed, UserAgent, Category
