AuditLogs
| where TimeGenerated > ago(14d)
| where Result <> "success"
| where Category == "UserManagement"
| distinct ActivityDisplayName, OperationName, ResultDescription, Result
| where OperationName in ("User changed default security info", "User registered all required security info", "User registered security info")
