AuditLogs
| where TimeGenerated > ago(14d)
| where Result <> "success"
| where Category == "UserManagement"
| extend Target =  tostring(TargetResources[0].userPrincipalName)
| distinct TimeGenerated,ActivityDisplayName,Target, OperationName, ResultDescription, Result
| where OperationName in ("User changed default security info", "User registered all required security info", "User registered security info")
