let timerange=14d;
SigninLogs
| project TimeGenerated, AuthenticationDetails, UserPrincipalName
| where TimeGenerated > ago (timerange)
| extend AuthMethod = tostring(parse_json(AuthenticationDetails)[0].authenticationMethod)
| where AuthMethod != "Previously satisfied"
| where AuthMethod in ("FIDO2 security key", "Passwordless phone sign-in", "Windows Hello for Business")
| distinct UserPrincipalName, AuthMethod
| summarize pwdlessTotal = count() by AuthMethod
