SigninLogs
| where TimeGenerated > ago(120d)
| where RiskLevelDuringSignIn in ("high","medium","low") or RiskLevelAggregated in ("high","medium","low")
| where RiskEventTypes_V2 contains "passwordSpray"
| project AppDisplayName, UserPrincipalName, RiskLevelAggregated, RiskLevelDuringSignIn, RiskState, RiskDetail, RiskEventTypes, RiskEventTypes_V2,MfaDetail,ConditionalAccessStatus,AuthenticationRequirement
