SigninLogs
| where AuthenticationDetails has "SuspiciousActivityReported"
| project TimeGenerated, UserPrincipalName, AuthenticationDetails, AppDisplayName, ResultType, ResultDescription, IPAddress

//can also use this one -------------------
//AuditLogs
//| where OperationName == "Suspicious activity reported"

//or this one ----------------
//AADUserRiskEvents 
//| where RiskEventType == "userReportedSuspiciousActivity"
