//this will retrieve accounts with multiple bad password attempts
SigninLogs 
| where TimeGenerated > ago(5d) 
| where ResultType == 50126
| summarize lockoutcount = count() by UserPrincipalName, startofday(TimeGenerated)
| where lockoutcount > 5
| sort by lockoutcount
