AADNonInteractiveUserSignInLogs 
| union SigninLogs 
| where TimeGenerated > ago(14d) 
| where NetworkLocationDetails !contains "trustedNamedLocation"
| where UserPrincipalName startswith "Sync_" or AppDisplayName == 'Microsoft Azure Active Directory Connect'
| extend TrustedLocation = tostring(iff(NetworkLocationDetails contains 'trustedNamedLocation', 'trustedNamedLocation','')) 
| distinct IPAddress, TrustedLocation, UserPrincipalName, AppDisplayName
